🚀&nbsp; env0 had composed a PR Plan for environment [NonProd - 244172364962 / FrontEnd Servers EC2-45599 ](https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/9b033b05-aebb-4bc8-857c-edad8e4fe2a0?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-0a15226b1f7f23580"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = false
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3a.medium"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = false
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = "subnet-0239c0713c64a677f"
+       tags                                 = {
+           "Demo"                = "May 20"
+           "ENV0_URL"            = "https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/9b033b05-aebb-4bc8-857c-edad8e4fe2a0"
+           "Name"                = "acme-frontend"
+           "Owner"               = "acme demo org"
+           "Terraform"           = "true"
+           "env0_environment_id" = "9b033b05-aebb-4bc8-857c-edad8e4fe2a0"
+           "env0_project_id"     = "7320dd7a-4822-426c-84b5-62ddd8be0799"
        }
+       tags_all                             = {
+           "Demo"                = "May 20"
+           "ENV0_URL"            = "https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/9b033b05-aebb-4bc8-857c-edad8e4fe2a0"
+           "Name"                = "acme-frontend"
+           "Owner"               = "acme demo org"
+           "Terraform"           = "true"
+           "env0_environment_id" = "9b033b05-aebb-4bc8-857c-edad8e4fe2a0"
+           "env0_project_id"     = "7320dd7a-4822-426c-84b5-62ddd8be0799"
        }
+       tenancy                              = "default"
+       volume_tags                          = {
+           "ENV0_URL"            = "https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/9b033b05-aebb-4bc8-857c-edad8e4fe2a0"
+           "Name"                = "acme-frontend"
+           "env0_environment_id" = "9b033b05-aebb-4bc8-857c-edad8e4fe2a0"
+           "env0_project_id"     = "7320dd7a-4822-426c-84b5-62ddd8be0799"
        }
+       vpc_security_group_ids               = (known after apply)

+       credit_specification {
+           cpu_credits = "standard"
        }

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       metadata_options (known after apply)

+       network_interface (known after apply)

+       root_block_device (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   instances  = [
+       (known after apply),
    ]
+   private_ip = [
+       (known after apply),
    ]
+   public_ip  = [
+       (known after apply),
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "password" but a value
│ was found in file "env0.auto.tfvars.json". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ENV0_INSTALLED_TOOLS"
│ but a value was found in file "env0.auto.tfvars.json". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$28 ($0.00 → $28)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

+ module.acme-ec2.aws_instance.this[0]
  +$28

+     Instance usage (Linux/UNIX, on-demand, t3a.medium)
      +$27

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$28 ($0.00 → $28)

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate increased by $28 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃          +$28 ┃           - ┃         +$28 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/9b033b05-aebb-4bc8-857c-edad8e4fe2a0/deployments/6b48d278-ccb4-4d0a-ad60-5135def52076?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[Get instant insights with AI Summary](https://app.env0.com/p/7320dd7a-4822-426c-84b5-62ddd8be0799/environments/9b033b05-aebb-4bc8-857c-edad8e4fe2a0/deployments/6b48d278-ccb4-4d0a-ad60-5135def52076?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)